[{"title":"Online investment platform Groww crosses 40 lakh users","content":"Launched in 2017, Groww aims to simplify investing by letting users open accounts and invest in any mutual fund instantly, through UPI or net banking. With 40 lakh users, Groww offers zero commission mutual funds and is launching stock investing soon. Groww has received net funding of $30mn, from investors like Mukesh Bansal, YC, Sequoia India, Ribbit Capital among others.","category":"business"},{"title":"No better person than Pichai to lead Google & Alphabet: Google Co-founders ","content":"Google Co-founders Larry Page and Sergey Brin, who named Google CEO Sundar Pichai the CEO of parent company Alphabet too, in a statement said that there's \"no better person\" than Pichai to lead Google and Alphabet. \"He's worked closely with us for 15 years,\" they said. \"There's no one that we've relied on more since Alphabet was founded,\" they added.","category":"business"},{"title":"This won't affect Alphabet structure: Pichai on being appointed Alphabet CEO","content":"On being appointed as Alphabet's CEO, Google CEO Sundar Pichai in a letter addressed to employees said, \"I want to be clear that this transition won't affect the Alphabet structure or the work we do day to day.\" He added, \"I'll continue to be very focused on Google.\" \"At the same time, I am excited about Alphabet,\" he further said.","category":"business"},{"title":"P Chidambaram walks out of Tihar Jail after 106 days","content":"Congress leader P Chidambaram walked out of Tihar Jail on Wednesday evening after spending 106 days in custody in connection with the INX Media case. His release came after the Supreme Court today granted him bail on conditions like surrendering his passport and making himself available for questioning. Chidambaram was arrested on August 21 by the Central Bureau of Investigation.","category":"business"},{"title":"What peak is there now to climb: Harsha Bhogle congratulates Pichai","content":"Cricket commentator Harsha Bhogle took to Twitter to congratulate Google CEO Sundar Pichai, who has now also been named the CEO of Google-parent Alphabet. \"So Sundar Pichai is now head of Alphabet in addition to Google. What a career. Delighted and proud,\" wrote Bhogle, adding, \"What peak is there now to climb!\" \"Thank you, Harsha:),\" replied Pichai.","category":"business"},{"title":"What is the life journey of Sundar Pichai, CEO of Alphabet and Google?","content":"Madurai-born Alphabet CEO Sundar Pichai, an alumnus of Wharton, Stanford University and IIT Kharagpur, worked at McKinsey & Co before joining Google in 2004. Credited for making the Google Chrome browser, Pichai took over Android business from its founder Andy Rubin. He was named head of Google's products before being promoted as Google CEO when Alphabet was created in 2015.","category":"business"},{"title":"'League of Legends' game maker to settle gender bias case for $10 mn","content":"Video game 'League of Legends' maker Riot Games agreed to pay $10 million to settle a class-action lawsuit that alleged widespread gender discrimination. This includes payment to around 1,000 current and former female employees. Earlier this year, months after the lawsuit was filed, over 150 employees walked out to protest Riot Games' legal bid to force the plaintiffs into arbitration.","category":"business"},{"title":"Every founder dreams of teammate like you: Paytm CEO to Google CEO","content":"Paytm Founder and CEO Vijay Shekhar Sharma congratulated Google's Chennai-born CEO Sundar Pichai on Twitter on being named the CEO of Google's parent company Alphabet too. \"Very well deserved. Every founder dreams of a teammate like you,\" Sharma said. Notably, Google Co-founders Larry Page and Sergey Brin have decided to transition from their roles as Alphabet's CEO and President, respectively.","category":"business"},{"title":"India's most robust export product: Mahindra congratulates Google CEO","content":"Mahindra Group Chairman Anand Mahindra congratulated Chennai-born Google CEO Sundar Pichai after the latter was named the CEO of Google's parent company Alphabet as well. \"India's most robust export product is probably the 'Global CEO',\" Mahindra wrote. \"If only there was some way of monetising these 'exports', India would have a perpetual balance of payments surplus,\" he added.","category":"business"},{"title":"Incredibly proud: Rajan Anandan on Google CEO being named Alphabet CEO","content":"Former Google India head and current Managing Director at Sequoia Capital, Rajan Anandan congratulated Google's 47-year-old Chennai-born CEO Sundar Pichai on being named Google's parent company Alphabet's CEO too. \"So incredibly proud of you and super excited for Google and Alphabet,\" Anandan said. Notably, Anandan served as Google VP for India and SEA for over eight years, till May 2019.","category":"business"},{"title":"Feel embarrassed to ask, govt must pay: States to FM on GST compensation","content":"The Finance Ministers of several states met Union Finance Minister Nirmala Sitharaman on Wednesday urging her to release the pending bi-monthly GST compensation, paid to states for their loss of revenue following GST implementation. \"We can't come to Delhi every day, we feel embarrassed. Government is under obligation to pay,\" Punjab Finance Minister Manpreet Singh Badal said after the meeting.","category":"business"},{"title":"Centre asks states to halt online sales of medicines","content":"The Central Drugs Standard Control Organisation under the Health Ministry has asked all states to enforce a Delhi High Court directive prohibiting online medicine sales. The government is yet to finalise regulations for online e-pharmacies. Meanwhile, e-pharmacy Netmeds' Founder and CEO Pradeep Dadha said his firm was complying with all laws and regulations and business was continuing as usual.","category":"business"},{"title":"Pakistani property tycoon hands over ₹1,770 crore to UK authorities","content":"Pakistani property tycoon Malik Riaz Hussain has agreed to hand over £190 million (₹1,770 crore) held in the UK to settle an investigation into whether the money was proceeds of crime. One of Pakistan's biggest private employers, Hussain is the owner of Bahria Town, which develops gated housing communities. UK authorities said the money will be repatriated to Pakistan government.","category":"business"},{"title":"Ujjivan Small Finance Bank IPO becomes 2019's most subscribed, beats IRCTC","content":"The Initial Public Offering of Ujjivan Small Finance Bank was subscribed 166 times on the last day, becoming the most subscribed IPO of 2019. It overtook Indian Railway Catering And Tourism Corporation's (IRCTC) IPO, which was subscribed 112 times. The market value of the lender, which aimed to raise nearly ₹750 crore, will be nearly ₹6,400 crore after the IPO.","category":"business"},{"title":"Infosys Co-founder Narayana Murthy's son Rohan marries Aparna Krishnan","content":"Rohan Murty, the son of Infosys Co-founder Narayana Murthy and Sudha Murty, married Aparna Krishnan in a private ceremony in Bengaluru on Monday. The couple, who met through common friends, have reportedly known each other for three years. Rohan Murty is the Founder of the Murty Classical Library of India, while Aparna Krishnan is the Co-founder of startup Opyn.","category":"business"},{"title":"India to launch 1st debt exchange-traded fund 'Bharat Bond ETF'","content":"The Union Cabinet on Wednesday approved the launch of India's first debt exchange-traded fund, called the Bharat Bond ETF, comprising bonds of state-run companies and other government entities. The ETF will have a fixed maturity of three and 10 years and will trade on NSE. Retail investors will be able to invest in the bonds with as little as ₹1,000.","category":"business"},{"title":"Jio to hike tariffs by up to 39% from December 6, reveals new plans","content":"Reliance Jio on Wednesday unveiled new prepaid plans that are up to 39% costlier and will be applicable from December 6. Jio will now charge customers ₹555 for an 84-day plan with 1.5 GB data\/day compared to Airtel at ₹598 and Vodafone Idea at ₹599. The revised tariffs of Airtel and Vodafone Idea went into effect on December 3.","category":"business"},{"title":"Our crew are human too: Vistara after user posts pic of air hostess sleeping","content":"Vistara Chief Commercial Officer Sanjiv Kapoor responded to a Twitter user who posted a picture of an air hostess sleeping at an airport. The user asked Vistara to \"improve\" its image.  \"We don't condone such photos being taken of our crew...without permission. Our crew...are human too. We suggest you do the right thing and take the photo down,\" Kapoor said.","category":"business"},{"title":"Airtel to raise up to ₹21,500 crore after SC ruling on past dues","content":"Airtel has said it would raise up to ₹21,500 crore via debt and equity after a recent Supreme Court ruling asked telecom companies to pay ₹92,000 crore to the government. It reported a loss of ₹23,045 crore for the September quarter after it made a provision for the dues. Airtel and Vodafone Idea had recently sought relief from the government. ","category":"business"},{"title":"Over 92,000 BSNL, MTNL employees opted for VRS: Union Minister","content":"Over 92,000 employees of BSNL and MTNL have opted for voluntary retirement, Union Minister Ravi Shankar Prasad said. \"The VRS scheme will pave the way for a leaner meaner force,\" Prasad added. He further said that 75% of the BSNL revenue is spent on the salaries of its employees, whereas the MTNL is spending 87% of its revenue on salaries.","category":"business"},{"title":"SBI to cut 8% stake in UTI mutual fund through IPO","content":"State Bank of India will cut its stake in mutual fund UTI Asset Management Company (UTI AMC) by about 8.25% through an initial public offering. The bank holds an 18.24% stake in the company. SBI will cut its stake in UTI AMC through an offer for sale of up to 10.5 million shares, the bank said in a filing. ","category":"business"},{"title":"Govt may ease foreign control rule to aid Air India sale: Reports","content":"The government is planning to revise its rule to allow overseas control of local airlines to attract foreign buyers for Air India's sale, reports said. Foreign airlines can't buy over 49% stake in local airlines while other foreign investors need government approval to buy over 49% stake. Government has set March 31, 2020 as the deadline for Air India disinvestment.","category":"business"},{"title":"Hyundai Motor unveils plan to invest $52 bn over six years","content":"Hyundai Motor is planning to invest about $51.8 billion between 2020-2025 towards future mobility devices with part of the amount towards electric and autonomous vehicles, the company announced. Hyundai will invest over $16 billion towards vehicle electrification, AI and autonomous driving as it aims to develop flying cars. The carmaker aims to sell 6,70,000 electric vehicles annually by 2025.","category":"business"},{"title":"CSB Bank share lists at 41% premium to issue price in trading debut","content":"Shares of Kerala-based CSB Bank listed at 41% premium against its issue price of ₹195 per share on the first day of trade on Wednesday. The stock extended gains and rallied 57% to hit a high of about ₹307 on the exchange and settled at 54% higher at ₹300. The ₹410-crore IPO of CSB Bank was subscribed nearly 87 times.\n","category":"business"},{"title":"Saudi Aramco IPO institutional tranche nearly 3 times oversubscribed","content":"Saudi Aramco's institutional tranche for its IPO has been oversubscribed by nearly three times, receiving orders worth $50.4 billion, financial advisers said. Aramco is planning to sell 1.5% of its shares for up to $25.6 billion. Banks said, it has got subscription orders for 5.9 billion shares in the first 17 days of the IPO, which began on November 17.","category":"business"},{"title":"Latest Test rankings out, Virat Kohli reclaims no. 1 ranking from Smith","content":"Team India captain Virat Kohli has reclaimed the top position in the latest rankings for Test batsmen from Australia batsman Steve Smith. Kohli, who struck 136 in the Day-Night Test against Bangladesh, reached 928 points, while Smith's knock of 36 against Pakistan in Adelaide pink-ball Test saw him slip to 923 points from 931 before the match.","category":"sports"},{"title":"Sehwag fell short by 7 runs to become 1st player with 3 triple tons","content":"On December 4, 2009, Virender Sehwag was dismissed for 293(254) on the third day of the Mumbai Test against Sri Lanka, falling short by just seven runs to become the first cricketer to hit three Test triple centuries. Sehwag, whose innings included 40 fours and seven sixes, was dismissed by Muttiah Muralitharan in the fourth over of the day.","category":"sports"},{"title":"Ashwin mocks Nithyananda's 'Kailaasa' country, asks for visa procedure","content":"After rape-accused self-styled godman Nithyananda claimed to have founded his own country and designed its flag, constitution and emblem, Team India off-spinner Ravichandran Ashwin took to Twitter to mock it. \"What is the procedure to get visa?? Or is it on arrival?\" Ashwin jokingly said. \"Any benefits for people investing in the country?\" he further asked.","category":"sports"},{"title":"Bumrah is a baby bowler, I would have easily dominated him: Abdul Razzaq","content":"Former Pakistan all-rounder Abdul Razzaq has said he would not have had any problems in dealing with Jasprit Bumrah if he had still been active now. \"I have played against great bowlers like Glenn McGrath and Wasim Akram, so Bumrah is a baby bowler in front of me and I could have easily dominated and attacked him,\" he added.","category":"sports"},{"title":"Bradman once hit 185 in 1 innings, India scored 156 in entire match","content":"Legend Don Bradman smashed 185 runs to help Australia post 382 against India in a Test that ended on December 4, 1947. India were dismissed for 58 in the first innings and 98 in the second and their combined score of 156 could not overhaul Bradman's individual score. The highest score for India in the match was Chandu Sarwate's 26.","category":"sports"},{"title":"Team once took 20 wkts for 59 after hitting 910 in 1 innings","content":"Pakistan Railways dismissed Dera Ismail Khan for 59 runs combined in two innings after registering 910\/6 in their first innings in a first-class match which ended on December 4, 1964. Pakistan Railways' winning margin of an innings and 851 runs is the biggest first-class victory ever. The match witnessed a triple ton, a double hundred, two hundreds and 11 ducks.","category":"sports"},{"title":"Agarkar scored only 1 ton in int'l cricket, it was at Lord's","content":"Former Indian cricketer Ajit Agarkar scored only one international hundred in his career, which came in a Test against England at Lord's in July 2002. Batting at number eight, Agarkar slammed an unbeaten 109, becoming the seventh Indian to smash a Test ton at Lord's. Agarkar, who turned 42 today, also hit the fastest fifty by an Indian in ODIs.","category":"sports"},{"title":"Pak fans criticise Imam-ul-Haq over laughing picture, Gillespie responds","content":"Pakistani fans criticised opener Imam-ul-Haq over his laughing picture with Justin Langer following Pakistan's defeat against Australia. \"This shameless man doesn't deserve to be in team,\" a fan wrote. Defending Imam, ex-Australian pacer Jason Gillespie tweeted, \"Players on losing side are disappointed...I thought it was fantastic...Imam was spending time with...Langer talking about cricket.\"","category":"sports"},{"title":"Shafali, who broke Sachin's record, once played posing as her sick brother","content":"India Women's 15-year-old opener Shafali Verma, who recently broke Sachin Tendulkar's record to become youngest Indian to score an international fifty, once played a boys' tournament posing as her brother. Her father revealed his son Sahil was sick and Shafali played the tournament and won Man of the Series, with nobody getting to know she was a girl.","category":"sports"},{"title":"Invite kyun nahi kiya: Rashid Khan wishes Manish Pandey on getting married","content":"Afghanistan leg-spinner Rashid Khan took to Twitter to wish his SunRisers Hyderabad teammate Manish Pandey on getting married. \"Congratulations my brother @im_manishpandey Raja wishing you a lifetime of happiness together and a love that grows stronger with each passing day. Lekan Invite Q nahi kya (But why didn't you invite me?),\" Rashid wrote. Manish married South Indian actress Ashrita Shetty.","category":"sports"},{"title":"Who is Meerut-born Priyam Garg, who will lead India in 2020 U-19 World Cup?","content":"Priyam Garg, who will lead India in 2020 Under-19 World Cup, was born in UP's Meerut on November 30, 2000. The right-handed batsman, who represents UP in domestic cricket, slammed century on his Ranji debut aged 17. He has led India Under-19 in eight Youth ODIs, winning six. Priyam averages 66.69 in first-class cricket and 41.46 in List A cricket.","category":"sports"},{"title":"What peak is there now to climb: Harsha Bhogle congratulates Pichai","content":"Cricket commentator Harsha Bhogle took to Twitter to congratulate Google CEO Sundar Pichai, who has now also been named the CEO of Google-parent Alphabet. \"So Sundar Pichai is now head of Alphabet in addition to Google. What a career. Delighted and proud,\" wrote Bhogle, adding, \"What peak is there now to climb!\" \"Thank you, Harsha:),\" replied Pichai.","category":"sports"},{"title":"Former England captain Bob Willis dies aged 70 due to cancer","content":"Former England captain Bob Willis has died at the age of 70 after battle with cancer. The former fast bowler played in 90 Tests and 64 ODIs for England after his 1971 debut and retired in 1984. Finishing his Test career with 325 wickets, Willis stands at fourth on the all-time list of England wicket-takers.","category":"sports"},{"title":"Smith responds to Chappell's criticism, says wasn't trying to undermine Paine","content":"Australia batsman Steve Smith has responded to former Australia captain Ian Chappell's claims that he was trying to 'white ant' or undermine Tim Paine during the second Test against Pakistan. \"I only try and help Tim as much as I can. He's doing a terrific job, but I give him suggestions and things like that,\" Smith said.","category":"sports"},{"title":"Hope to get another chance to knock 400 off: Warner after meeting Lara","content":"Australia opener David Warner shared a picture of himself with ex-West Indies captain Brian Lara. Warner, who scored 335* in a Test against Pakistan, wrote, \"Great to catch up with the legend himself...Maybe one day I'll get another chance to knock 400 off.\" Lara, who holds the record for highest Test score (400*), shared the picture, writing, \"735 Not Out!\"","category":"sports"},{"title":"My father sold milk to see me play: India's new U-19 cricket team captain","content":"UP batsman Priyam Garg, who has been named India captain for 2020 Under-19 World Cup, said his father did \"odd jobs\" to ensure his game doesn't get affected due to monetary issues. He added his father sold milk during the day and slipped a ₹10 note to him at night so he could travel to Meerut for cricket nets.","category":"sports"},{"title":"Former Pakistan coach Mickey Arthur to be Sri Lanka's head coach","content":"Former Pakistan head coach Mickey Arthur will be Sri Lanka's new national cricket team coach on a two-year contract, Sri Lanka Cricket CEO Ashley De Silva has said. Arthur will be supported by Zimbabwean Grant Flower as batting coach and Australian David Sekar as bowling coach. The 51-year-old Arthur will be Sri Lanka's 11th coach in the last eight years. \n","category":"sports"},{"title":"Pujara to play first two games for Saurashtra in Ranji Trophy","content":"Cheteshwar Pujara has been named in the 16-member Saurashtra squad for its first two games in the Ranji Trophy, beginning from December 9. Saurashtra, who lost to Vidarbha in last year's Ranji Trophy final, are placed in the Elite Group B and will play their first match against Himachal Pradesh in Dharamshala. Left-arm pacer Jaydev Unadkat will lead Saurashtra.","category":"sports"},{"title":"Messi's win ok but Real Madrid robbed Ronaldo last yr: Chiellini","content":"After Lionel Messi's sixth Ballon d'Or win Monday, Juventus' Giorgio Chiellini said, \"It's ok that Messi has won the Ballon d'Or...[Cristiano] Ronaldo was really robbed of the Ballon d'Or last season.\" \"Modric even in his best season of his career didn't deserve it. That was a signal from Real, as they wanted to stop Ronaldo winning it,\" Chiellini added.","category":"sports"},{"title":"New Zealand Police to investigate racist abuse of Archer","content":"New Zealand Cricket (NZC) has lodged a complaint with Tauranga police asking it to investigate the incident of racial abuse directed at England cricketer Jofra Archer during the first Test at the Bay Oval. In a series of tweets, Archer had alleged of racial abused directed towards him by an unidentified spectator last week.","category":"sports"},{"title":"I'm not here to replace Hardik Pandya: Shivam Dube ","content":"On being included in the squads for T20I and ODI series against West Indies, all-rounder Shivam Dube said that it's not an opportunity to replace Hardik Pandya. \"I have got a job for my country and I will try to do that better,\" he added. Dube made his India debut during the T20I series against Bangladesh last month. ","category":"sports"},{"title":"Foundation of Indian pace attack laid by likes of Kapil Dev: Bishop","content":"Former Windies pacer Ian Bishop has said that the foundation of the current Indian pacers was laid by the likes of Kapil Dev. \"Now it's been built on with a captain who likes fast bowlers, who believe[s] in them,\" he added. Calling Bumrah a \"generational talent\", Bishop stated that both Shami and Ishant have taken their games to \"another level\".\n","category":"sports"},{"title":"See you soon in Italy: Zlatan Ibrahimovic hints at Serie A return","content":"Former Manchester United and Barcelona striker Zlatan Ibrahimovic has hinted at his return to Serie A by saying \"see you soon in Italy\" during an interview. This comes amid reports of the Swedish forward being offered a six-month deal by his former Italian side AC Milan. Last month, Ibrahimovic announced his decision to part ways with MLS club LA Galaxy.","category":"sports"},{"title":"We are underdogs and that's fine: Pollard ahead of T20I series vs Ind","content":"Ahead of the three-match T20I series against India, West Indies limited-overs captain Kieron Pollard said they are underdogs going into the series and that's fine. \"It is about going out there and executing and believing in your talent, once you do that anything is possible,\" he added. Windies have recently won a bilateral series against Afghanistan, held in India.","category":"sports"},{"title":"We can make him bat with a stump: WI coach on how to get Kohli out","content":"On being asked about his plans for India captain Virat Kohli, West Indies coach Phil Simmons jokingly said that they can maybe have two bowlers to bowl at Kohli at the same time. Another option is to \"make him bat with a stump,\" Phil added. \"We can make sure that the bowlers don't get too scared of him,\" he stated.","category":"sports"},{"title":"Sundar Pichai becomes Alphabet CEO as Google Co-founders step down","content":"Google Co-founders Larry Page and Sergey Brin have announced Google CEO Sundar Pichai is replacing Page as CEO of parent company Alphabet. \"Larry Page and Sergey Brin have decided to transition from their roles as CEO and President, respectively, of Alphabet,\" a press release by Alphabet stated. \"Alphabet and Google no longer need two CEOs and a President,\" it added.","category":"technology"},{"title":"Delhi to get 11,000 free Wi-Fi hotspots, 100 to come up by Dec 16","content":"Delhi CM Arvind Kejriwal on Wednesday announced that 11,000 Wi-Fi hotspot zones will be set up at bus stops and markets in the national capital to provide free internet. Stating that the project will cost ₹100 crore, Kejriwal added, \"Every user will be given 15 GB data free, every month.\" The first 100 hotspots will be inaugurated on December 16. ","category":"technology"},{"title":"From learning alphabets in Jawahar to Alphabet CEO: Xiaomi India VP to Pichai","content":"Xiaomi's Global Vice President and India VP Manu Kumar Jain on Wednesday took to Twitter to congratulate Sundar Pichai on being appointed as Alphabet's CEO. \"From learning alphabets in Jawahar Vidyalaya to leading \"Alphabet\"...You are an inspiration to all,\" tweeted Jain. Notably, Sundar Pichai studied at CBSE-affiliated Jawahar Vidyalaya in Chennai till Class 10.","category":"technology"},{"title":"This won't affect Alphabet structure: Pichai on being appointed Alphabet CEO","content":"On being appointed as Alphabet's CEO, Google CEO Sundar Pichai in a letter addressed to employees said, \"I want to be clear that this transition won't affect the Alphabet structure or the work we do day to day.\" He added, \"I'll continue to be very focused on Google.\" \"At the same time, I am excited about Alphabet,\" he further said.","category":"technology"},{"title":"No better person than Pichai to lead Google & Alphabet: Google Co-founders ","content":"Google Co-founders Larry Page and Sergey Brin, who named Google CEO Sundar Pichai the CEO of parent company Alphabet too, in a statement said that there's \"no better person\" than Pichai to lead Google and Alphabet. \"He's worked closely with us for 15 years,\" they said. \"There's no one that we've relied on more since Alphabet was founded,\" they added.","category":"technology"},{"title":"I've underwear on: Jason Derulo after Instagram removes his pic over 'nudity'","content":"American singer Jason Derulo has revealed that Instagram removed a picture he posted as it went \"against its Community Guidelines on nudity or sexual activity\". \"[F**k you] mean? I've underwear on...I can't help my size,\" he wrote while sharing a screenshot of the Instagram notification which said his post has been removed. The singer also posted the photo once again. ","category":"technology"},{"title":"What peak is there now to climb: Harsha Bhogle congratulates Pichai","content":"Cricket commentator Harsha Bhogle took to Twitter to congratulate Google CEO Sundar Pichai, who has now also been named the CEO of Google-parent Alphabet. \"So Sundar Pichai is now head of Alphabet in addition to Google. What a career. Delighted and proud,\" wrote Bhogle, adding, \"What peak is there now to climb!\" \"Thank you, Harsha:),\" replied Pichai.","category":"technology"},{"title":"TikTok admits it censored posts by 'disabled, fat or LGBTQ+' users","content":"Chinese startup ByteDance's lip-syncing video platform TikTok admitted to censoring posts of users it identified as 'disabled, fat or LGBTQ+'. The platform claimed that it did so in an effort to cut down bullying on vulnerable users. \"While the intention was good, the approach was wrong,\" TikTok said, adding that it was \"never intended to be a long-term solution\".","category":"technology"},{"title":"Incredibly proud: Rajan Anandan on Google CEO being named Alphabet CEO","content":"Former Google India head and current Managing Director at Sequoia Capital, Rajan Anandan congratulated Google's 47-year-old Chennai-born CEO Sundar Pichai on being named Google's parent company Alphabet's CEO too. \"So incredibly proud of you and super excited for Google and Alphabet,\" Anandan said. Notably, Anandan served as Google VP for India and SEA for over eight years, till May 2019.","category":"technology"},{"title":"Pablo Escobar's brother launches ₹25,000 foldable smartphone","content":"Roberto Escobar, the brother of Pablo Escobar, has launched foldable smartphone 'Escobar Fold 1', which has a starting price of $349 (around ₹25,000 for 128GB) and goes up to $499 (around ₹35,800 for 512GB). The smartphone features a flexible screen that folds into a tablet. \"I have told many people that I would beat Apple and I will,\" Roberto said.","category":"technology"},{"title":"India's most robust export product: Mahindra congratulates Google CEO","content":"Mahindra Group Chairman Anand Mahindra congratulated Chennai-born Google CEO Sundar Pichai after the latter was named the CEO of Google's parent company Alphabet as well. \"India's most robust export product is probably the 'Global CEO',\" Mahindra wrote. \"If only there was some way of monetising these 'exports', India would have a perpetual balance of payments surplus,\" he added.","category":"technology"},{"title":"Every founder dreams of teammate like you: Paytm CEO to Google CEO","content":"Paytm Founder and CEO Vijay Shekhar Sharma congratulated Google's Chennai-born CEO Sundar Pichai on Twitter on being named the CEO of Google's parent company Alphabet too. \"Very well deserved. Every founder dreams of a teammate like you,\" Sharma said. Notably, Google Co-founders Larry Page and Sergey Brin have decided to transition from their roles as Alphabet's CEO and President, respectively.","category":"technology"},{"title":"What is the life journey of Sundar Pichai, CEO of Alphabet and Google?","content":"Madurai-born Alphabet CEO Sundar Pichai, an alumnus of Wharton, Stanford University and IIT Kharagpur, worked at McKinsey & Co before joining Google in 2004. Credited for making the Google Chrome browser, Pichai took over Android business from its founder Andy Rubin. He was named head of Google's products before being promoted as Google CEO when Alphabet was created in 2015.","category":"technology"},{"title":"28-yr-old Thai man electrocuted to death using phone while charging","content":"A 28-year-old man, Kittisak Moonkitti, was found dead on his bed after suspected electrocution by his Android smartphone plugged into charging, in Thailand. The man was found holding his smartphone, with burn marks on the hand and both forearms. His mother Rinnaporn said she tried to wake him up by yelling his name and poking him, but he didn't respond.","category":"technology"},{"title":"NASA says will launch and attach a 'robot hotel' to space station","content":"NASA announced the launch of a protective storage unit for critical robotic tools, called the Robotic Tool Stowage (RiTS), with the 19th SpaceX commercial resupply mission. \"Robots need a place to stay in space, too. NASA is attaching a 'robot hotel' to the outside of the International Space Station,\" the agency said. The mission launch is scheduled for December 4.","category":"technology"},{"title":"'League of Legends' game maker to settle gender bias case for $10 mn","content":"Video game 'League of Legends' maker Riot Games agreed to pay $10 million to settle a class-action lawsuit that alleged widespread gender discrimination. This includes payment to around 1,000 current and former female employees. Earlier this year, months after the lawsuit was filed, over 150 employees walked out to protest Riot Games' legal bid to force the plaintiffs into arbitration.","category":"technology"},{"title":"Union Cabinet approves Personal Data Protection Bill, 2019","content":"The Union Cabinet, headed by Prime Minister Narendra Modi, approved the Personal Data Protection Bill, 2019, Union minister Prakash Javadekar said on Wednesday. The bill has been approved for introduction in the Winter Session of Parliament. It is expected to lay down a framework that will include processing of personal and private data by public and private entities.","category":"technology"},{"title":"Customers will soon be able to withdraw cash using UPI","content":"Customers will soon be able to withdraw cash through ATMs using UPI, apart from merchant payments and interpersonal transactions. The new feature will be introduced for users of Bank of India in the next three-six months. NPCI has created a committee to review the interoperability guidelines to open the feature for other bank customers as well, as per reports.","category":"technology"},{"title":"Google removed over 300 Trump ads for ‘violating company policy’","content":"Ahead of the 2020 US presidential elections, over 300 ads of President Donald Trump were not approved to run on Google or YouTube as they violated company policy, as per YouTube's transparency report. Trump's ads ran for a few days before they were removed. Trump's 'Make America Great Again Committee' has spent nearly $9 million in ads since May 2018.","category":"technology"},{"title":"Microsoft app that lets the blind identify photos gets 5 new languages","content":"Microsoft's computer vision app for the blind and poor-sighted, Seeing AI, has been updated with five more languages - Dutch, French, German, Japanese and Spanish. The app is free but is only available on iOS. Seeing AI uses 'computer vision' to narrate the user's surroundings, explore photos by touch and identify friends' facial cues.","category":"technology"},{"title":"IT panel urged to look out for child safety on social media","content":"Online community platform LocalCircles has urged parliamentary standing committee on information technology to look into issue of child safety on social media. It asked the panel to increase minimum age requirement for opening accounts on Instagram, Facebook and TikTok to 15 years. It also asked for the platforms to be held fully responsible for exposure of children to inappropriate content.","category":"technology"},{"title":"Genius sues Google for $50 million over 'stolen' song lyrics","content":"Lyrics website Genius sued Google for knowingly using copied song lyrics in search results and has asked for $50 million in damages. Genius accused lyric licensing company LyricFind of pulling lyrics directly from its page which Google subsequently used in its search results. The website hid a unique watermark in its lyrics that spelled out \"red handed\" in Morse Code. ","category":"technology"},{"title":"New browser extension makes hidden Instagram likes visible again","content":"Instagram users will now be able to see 'Like' counts on posts by installing 'The Return of the Likes' Chrome extension after the social media firm started hiding like and comment counts on its platform. The feature is not available through the mobile Instagram app and can be used by copying the profile link and opening it on a computer.","category":"technology"},{"title":"India ranks 73rd in UN index assessing e-commerce readiness","content":"India has ranked 73rd out of 152 countries listed in a business-to-consumer e-commerce index by the UN, which measures an economy's preparedness to support online shopping. The list, whose top 10 spots were dominated by eight European countries, was topped by Netherlands. India's place on the list was an improvement from its previous rank of 80 in 2018.  ","category":"technology"},{"title":"Facebook tests tool that allows users to move images to Google","content":"Facebook has started testing a new tool that will allow users to transfer their photos and videos from its platform to other online services, beginning with Google Photos. The new tool will be accessible to users in Ireland and will be launched worldwide in 2020. The tool will be modified based on feedback from users in Ireland, Facebook said.","category":"technology"},{"title":"India no country for women: Anoushka Shankar on Hyd vet's gangrape & murder","content":"Expressing her anger over the gangrape and murder of 27-year-old veterinarian in Hyderabad, Sitar player Anoushka Shankar on Tuesday posted on social media, \"This is a global epidemic. And India, in particular, is no country for women.\" She added that India made new laws and set up new courts after Nirbhaya's gangrape. \"And yet...Where is the change?\" she asked.","category":"entertainment"},{"title":"India is one of the best cinema industries in the world: Deadpool actor Ryan","content":"'Deadpool' actor Ryan Reynolds has said India is one of the best cinema industries in the world. When asked if he has watched any Indian action thriller, Ryan replied, \"I can't think about a particular action thriller\". \"But I've watched a lot of Bollywood stuff. There's a celebration of life...and I love how they approach everything with music,\" he said.","category":"entertainment"},{"title":"Filmmaker says 'women should carry condoms, cooperate with rapists'; criticised","content":"Daniel Shravan, a filmmaker, has been criticised for writing on Facebook that instead of calling police, women should carry condoms and cooperate with rapists to save themselves from murder. He later deleted his posts, saying he wrote those as dialogues of a villain in a movie he'll direct. \"Whoever this Daniel Shravan is, needs medical help,\" actress Kubbra Sait tweeted. ","category":"entertainment"},{"title":"I stalk Priyanka Chopra on social media, I think she has a baller life: Bhumi","content":"Actress Bhumi Pednekar in an interview to Zoom revealed that she stalks Priyanka Chopra on social media. \"I am constantly seeing what she's up to. I think she has a baller life,\" Bhumi added. The actress, who will appear alongside actor Kartik Aaryan in 'Pati Patni Aur Woh', also said that the latter's social media game is brilliant.","category":"entertainment"},{"title":"Man stalks, assaults TV actress and ex-Splitsvilla contestant Harshita; held","content":"The Churchgate Government Railway Police has arrested a 29-year-old man for allegedly stalking and assaulting actress and Splitsvilla 8 contestant Harshita Kashyap as well as her NRI friend at Charni Road railway station. Harshita alleged the man constantly kept stalking them and slapped her friend when confronted. \"I...started hitting him. He retaliated and he even started hitting me,\" she added.","category":"entertainment"},{"title":"Randeep Hooda dislocates knee during stunt, carried off set on shoulders","content":"Actor Randeep Hooda dislocated his patella while shooting a stunt sequence for 'Radhe: Your Most Wanted Bhai'. \"A co-actor jumped on my back with all his might...bringing all the weight down on one knee,\" he said. \"I tried to do more takes but that caused more damage...I had to be carried off the set on people's shoulders,\" Randeep added.","category":"entertainment"},{"title":"GoT actor Jason criticises Chris Pratt for using plastic bottle; Chris responds","content":"'Game of Thrones' actor Jason Momoa criticised actor Chris Pratt for a picture in which he can be seen holding a plastic water bottle. \"Bro I love you but wtf on the water bottle. No single-use plastic. Come on,\" he commented. Chris replied, \"You're completely right...I always carry my...reusable water jug around with me...I even had it that day!!!\"","category":"entertainment"},{"title":"Riteish accused of availing loan waiver meant for farmers, actor responds","content":"Actor Riteish Deshmukh has been accused of availing loan waiver worth ₹4.70 crore meant for farmers, with document naming him and his brother Amit Deshmukh surfacing on social media. Riteish responded to allegations, saying, \"The said paper in circulation is with mala fide motive.\" He added, \"There's no question of any loan waiver whatsoever. Please don’t be misled.\"","category":"entertainment"},{"title":"People should date who they want to: DiCaprio's girlfriend on 23-yr age gap","content":"Speaking about their 23-year age gap, Leonardo DiCaprio's girlfriend, actress Camila Morrone said, \"There are...many relationships in Hollywood, and in...the world, where people have large age gaps.\" \"I just think anyone should be able to date who they want to date,\" she added. Camila further said she's hopeful that as her career grows, she won't always be mentioned alongside DiCaprio.","category":"entertainment"},{"title":"Bengaluru schoolgirls sing Imagine Dragons' 'Believer'; singer responds","content":"A video of an all-girls choir from Bengaluru singing the song 'Believer' by Imagine Dragons in the school assembly has gone viral on social media. The band's lead singer Dan Reynolds responded to the video saying, \"so beautiful. thank you for sharing this.\" The official handle of the band also shared the video on Twitter and wrote, \"love this\".","category":"entertainment"},{"title":"If I was 50, I would feel odd romancing a 22-yr-old guy: Sonakshi","content":"Speaking about the growing age gap between Bollywood actors and their heroines, Sonakshi Sinha said, \"If I was...50, I'd feel odd romancing a 22-year-old guy.\" She added that audience accepts it when an older actor romances a younger actress, but when an older actress does it, it's not accepted. \"That...shows what kind of a country we live in,\" said Sonakshi.","category":"entertainment"},{"title":"Himesh replaces Anu as judge on Indian Idol 11 after latter quit over #MeToo","content":"Himesh Reshammiya has replaced Anu Malik as Indian Idol 11 judge after the latter stepped down \"to clear his name\" against sexual harassment allegations. \"I've no issues joining midway,\" Himesh told The Times of India. \"It looks like I'll be there till...end of...season,\" Himesh further said on being asked about Anu's statement that he'll be back after three weeks.","category":"entertainment"},{"title":"Ask him only: Sonakshi when asked about Salman romancing 21-yr-old actress","content":"When asked about 53-year-old Salman Khan romancing a 21-year-old actress, Sonakshi Sinha said, \"You should ask him only.\" \"[Ask him] what he's...doing to keep looking so young and keep romancing the younger girls,\" she added. On being pointed out that we never see \"a Madhuri Dixit romancing Ishaan Khatter\", Sonakshi said, \"But would you want to see [that]?...That [would be]...odd.\" ","category":"entertainment"},{"title":"I work with new directors because big directors don't take me: Akshay","content":"Akshay Kumar has said he works with debutant directors as big directors don't take him in their films. When asked if there was a time when big directors were only interested in working with the Khans, Akshay replied, \"They went to the people who deserved it.\" \"I presume I didn't deserve it, so I earned it my way,\" said Akshay.","category":"entertainment"},{"title":"I've underwear on: Jason Derulo after Instagram removes his pic over 'nudity'","content":"American singer Jason Derulo has revealed that Instagram removed a picture he posted as it went \"against its Community Guidelines on nudity or sexual activity\". \"[F**k you] mean? I've underwear on...I can't help my size,\" he wrote while sharing a screenshot of the Instagram notification which said his post has been removed. The singer also posted the photo once again. ","category":"entertainment"},{"title":"I said no to a Playboy shoot, I can't get naked in front of camera: Nargis","content":"In an interaction with former pornstar Brittni De La Mora, actress Nargis Fakhri revealed that she declined an offer to pose for Playboy magazine during her modelling days. \"I was like, Playboy is huge and the money was so much! But I said no thanks,\" Fakhri said. \"I'm so not into getting naked in front of a camera,\" she added.","category":"entertainment"},{"title":"Don't take films so seriously: Akshay on social responsibility of art","content":"Talking about his choices of doing social dramas and comedies, and the responsibility of films as an art form, Akshay Kumar said that a film shouldn't be taken \"so seriously\". \"I can't be like, 'Today, I need to teach this lesson'...I'm making films,\" he added. \"We show 'No smoking' but have people stopped smoking?\" he further said.","category":"entertainment"},{"title":"It's a great comparison: Kriti on comparison with Priyanka in Panipat","content":"Kriti Sanon has said that her character in her upcoming film, 'Panipat', is not similar to Priyanka Chopra's character in 'Bajirao Mastani'. \"I don't think her character went through the same journey as mine,\" she added. \"The situation is different, upbringing is different and the whole story is different. If it's a comparison, it's a great comparison,\" Kriti further said.","category":"entertainment"},{"title":"I've to feel butterflies in my stomach: Deepika on choosing scripts","content":"Deepika Padukone has said that she continues to choose scripts, the same way she did 10 years ago. \"When the narration finishes, I've to feel butterflies in my stomach, otherwise I don't take up the film. The film has to unsettle me,\" she said. \"I've to feel challenged. I've always listened to that voice in my head,\" Deepika added.","category":"entertainment"},{"title":"27-yr-old S Korean actor Cha In-Ha found dead at home","content":"South Korean actor Cha In-Ha, aged 27, was found dead in his apartment on Tuesday. His management company released a statement which confirmed the same but didn't indicate the cause of Cha's death. This comes after 28-year-old South Korean actress Goo Hara and 25-year-old popstar Sulli were found dead at their homes in November and October respectively.","category":"entertainment"},{"title":"Imtiaz Ali has changed my acting process, personal mindset: Kartik","content":"Talking about working with 'Love Aaj Kal 2' director Imtiaz Ali, Kartik Aaryan said that both his \"acting process and personal mindset\" have changed after working with him. \"I think I'm a changed man now. There has been a huge change in me since I've shot for his film,\" he added. \"I'm in love with Imtiaz sir,\" Kartik further said.","category":"entertainment"},{"title":"I loved a married director but didn't want to be homewrecker: Parekh","content":"Actor Asha Parekh revealed in an interview that late director Nasir Hussain, known for making Qayamat Se Qayamat Tak (1988), was the only man \"she has ever loved\". She added that since Nasir was a married man, she chose not to be a homewrecker. \"As much as I loved him...could never consider breaking up his family.\" she further said.","category":"entertainment"},{"title":"Will never do child abuse scene, no matter what the money is: Pankaj","content":"Actor Pankaj Tripathi has said that no matter how much money is offered, he'll never do a scene which involves child abuse in a film. He added that he'll also never \"sell the idea of fake masculinity\" through his work. \"I'm completely against portraying a man who is told that mard ko dard nahi hota,\" Pankaj further said.","category":"entertainment"},{"title":"Manushi Chhillar to promote AIDS awareness among women in India","content":"Miss World 2017 Manushi Chhillar has decided to spread awareness on AIDS among women across various villages in India through her non-profit organisation, Project Shakti. Manushi took to Instagram and wrote, \"On #WorldAidsDay, Project Shakti expands...starting an AIDS awareness programme among rural women in India.\" Project Shakti also aims at improving the menstrual hygiene of women in India.","category":"entertainment"},{"title":"De Niro defends Anna Paquin's 7 words of dialogue in 'The Irishman'","content":"Martin Scorsese's directorial 'The Irishman' has faced criticism over Anna Paquin's seven words of dialogue in the three-and-a-half-hour-long Netflix drama. Anna plays the role of Peggy in the film. Robert De Niro, who plays her father, has defended her and said, \"She was very powerful...in other scenes, there could've been some interaction between Frank and her...she's terrific and it resonates.\"","category":"entertainment"}]