[{"title":"RBI keeps repo rate unchanged at 5.15% after five cuts this year","content":"The RBI on Thursday kept the repo rate unchanged after five cuts this year. In 2019, the RBI has cut repo rate by 135 basis points so far but banks have passed on only a fraction of rate cuts to consumers. The status quo comes despite data showing growth slumping to a six-and-a-half-year low of 4.5% in the July-September quarter.","category":"business"},{"title":"P Chidambaram walks out of Tihar Jail after 106 days","content":"Congress leader P Chidambaram walked out of Tihar Jail on Wednesday evening after spending 106 days in custody in connection with the INX Media case. His release came after the Supreme Court today granted him bail on conditions like surrendering his passport and making himself available for questioning. Chidambaram was arrested on August 21 by the Central Bureau of Investigation.","category":"business"},{"title":"8, 7, 6.6, 5.8, 5 & 4.5 is the state of economy: Chidambaram on GDP growth","content":"Former Finance Minister P Chidambaram on Thursday said, \"Nothing sums up the state of the economy better than the following series of numbers: 8, 7, 6.6, 5.8, 5 and 4.5.\" He added, \"Those are the quarterly growth rates of GDP in the last six quarters.\" \"We'll be lucky if growth rate touches 5% by the year's end,\" he further said.","category":"business"},{"title":"Google Co-founders gain $2.3B after Sundar Pichai made Alphabet CEO","content":"Google Co-founders Sergey Brin and Larry Page added a combined $2.3 billion to their net worths after Google-parent Alphabet's stock rose about 2%, Bloomberg revealed. This came after Google's 47-year-old India-born CEO Sundar Pichai on Wednesday was also named Alphabet CEO. The two co-founders each own about 6% of the internet giant and still control Alphabet through special voting shares.","category":"business"},{"title":"Musk says in court his net worth is around $20 bn, not much in cash","content":"Tesla and SpaceX founder and CEO Elon Musk, in an ongoing defamation case by Thai cave rescuer Vernon Unsworth, testified that he estimates his net worth around $20 billion. However, Musk said his net worth comprises stocks in the aforementioned entities, with debt against those holdings, and is largely illiquid. The Bloomberg Billionaires Index puts his fortune at $26.6 billion.","category":"business"},{"title":"Nirav Modi declared fugitive economic offender over ₹14,000-crore PNB scam","content":"Nirav Modi has been declared a fugitive economic offender under Fugitive Economic Offenders Act by a special Mumbai court in connection with ₹14,000-crore Punjab National Bank scam case. The court will also give a judgement regarding confiscation of his properties later. Nirav is currently lodged in the UK's Wandsworth Prison.","category":"business"},{"title":"Maharashtra govt suggests merger of PMC Bank with MSC Bank","content":"In a bid to provide relief to depositors of scam-hit Punjab and Maharashtra Cooperative (PMC) Bank, Maharashtra government has suggested a merger of the bank with the Maharashtra State Cooperative Bank. If needed, the state government will speak to the RBI on the issue of the merger, state minister Jayant Patil said. He added that MSC Bank's health is good.","category":"business"},{"title":"Feel embarrassed to ask, govt must pay: States to FM on GST compensation","content":"The Finance Ministers of several states met Union Finance Minister Nirmala Sitharaman on Wednesday urging her to release the pending bi-monthly GST compensation, paid to states for their loss of revenue following GST implementation. \"We can't come to Delhi every day, we feel embarrassed. Government is under obligation to pay,\" Punjab Finance Minister Manpreet Singh Badal said after the meeting.","category":"business"},{"title":"S Korea's SK Group Chairman's wife files for divorce, seeks $1.2 billion","content":"Roh Soh-yeong, the wife of South Korean conglomerate SK Group's Chairman Chey Tae-won, has filed for divorce. Roh reportedly wants SK Holdings shares worth $1.2 billion held by Chey, who is its biggest shareholder. In 2017, two years after publicly confessing that he had extramarital affairs, Chey sought a court-mediated divorce but the two failed to reach an agreement.","category":"business"},{"title":"Our crew are human too: Vistara after user posts pic of air hostess sleeping","content":"Vistara Chief Commercial Officer Sanjiv Kapoor responded to a Twitter user who posted a picture of an air hostess sleeping at an airport. The user asked Vistara to \"improve\" its image.  \"We don't condone such photos being taken of our crew...without permission. Our crew...are human too. We suggest you do the right thing and take the photo down,\" Kapoor said.","category":"business"},{"title":"Airtel to raise up to ₹21,500 crore after SC ruling on past dues","content":"Airtel has said it would raise up to ₹21,500 crore via debt and equity after a recent Supreme Court ruling asked telecom companies to pay ₹92,000 crore to the government. It reported a loss of ₹23,045 crore for the September quarter after it made a provision for the dues. Airtel and Vodafone Idea had recently sought relief from the government. ","category":"business"},{"title":"Jio to hike tariffs by up to 39% from December 6, reveals new plans","content":"Reliance Jio on Wednesday unveiled new prepaid plans that are up to 39% costlier and will be applicable from December 6. Jio will now charge customers ₹555 for an 84-day plan with 1.5 GB data\/day compared to Airtel at ₹598 and Vodafone Idea at ₹599. The revised tariffs of Airtel and Vodafone Idea went into effect on December 3.","category":"business"},{"title":"Indonesia fires flag carrier's CEO for smuggling ₹41 lakh Harley on jet","content":"The Indonesian government has decided to fire flag carrier Garuda Indonesia's CEO Ari Askhara for smuggling a Harley-Davidson bike worth ₹41 lakh into the country on a new Airbus plane from France. Askhara had ordered the bike last year and bought it in April 2019. The payment was made through a Garuda finance manager based in Amsterdam, the government said.\n","category":"business"},{"title":"Ujjivan Small Finance Bank IPO becomes 2019's most subscribed, beats IRCTC","content":"The Initial Public Offering of Ujjivan Small Finance Bank was subscribed 166 times on the last day, becoming the most subscribed IPO of 2019. It overtook Indian Railway Catering And Tourism Corporation's (IRCTC) IPO, which was subscribed 112 times. The market value of the lender, which aimed to raise nearly ₹750 crore, will be nearly ₹6,400 crore after the IPO.","category":"business"},{"title":"Want control of manufacturing if we win $15bn India fighter jet deal: Saab","content":"Swedish manufacturer Saab has said it wants to control the \"entire system\" including local manufacturing if it wins India's $15-billion contract for 114 fighter jets. Saab has partnered with Adani Group for the bid. \"If a company needs to take responsibility for quality, time, cost and capability...I want to have some sort of control of that,\" CEO Micael Johansson said.","category":"business"},{"title":"RBI cuts India's GDP growth forecast for the current fiscal to 5%","content":"The RBI on Thursday lowered its GDP growth forecast for 2019-20 to 5% from 6.1% in the October policy. While it kept the repo rate unchanged at 5.15%, the RBI reiterated that it would maintain an accommodative stance as long as it is necessary to revive growth. \"There is space available for further monetary policy action,\" Governor Shaktikanta Das said.","category":"business"},{"title":"Ford to use McDonald's coffee bean waste to make car parts","content":"Ford and McDonald's have partnered for a project in which the carmaker will use coffee bean waste to make auto parts like headlamp housings. Ford will use coffee chaff - bean husk that comes off during roasting - which can be mixed with plastic and formed into shapes. Notably, Ford has been using soy-based foam in its cushions since 2011.","category":"business"},{"title":"6 tech giants contributed to $100 bn 'tax gap' in 10 yrs: Study","content":"A study by a British organisation that certifies businesses for good tax conduct stated six of Silicon Valley's top tech giants avoided paying over $100 billion in taxes over the past decade. It analysed global tax payments made by Amazon, Facebook, Google, Apple, Netflix and Microsoft. The research found over a $100-billion difference between their provisions and actual taxes paid. ","category":"business"},{"title":"Over 92,000 BSNL, MTNL employees opted for VRS: Union Minister","content":"Over 92,000 employees of BSNL and MTNL have opted for voluntary retirement, Union Minister Ravi Shankar Prasad said. \"The VRS scheme will pave the way for a leaner meaner force,\" Prasad added. He further said that 75% of the BSNL revenue is spent on the salaries of its employees, whereas the MTNL is spending 87% of its revenue on salaries.","category":"business"},{"title":"RBI raises peer-to-peer lending limit five-times to ₹50 lakh","content":"The Reserve Bank of India (RBI) has raised its lending limit to peer-to-peer (P2P) platforms five-folds to ₹50 lakh from current ₹10 lakh. However, the exposure of a single borrower is capped at ₹50,000 across all NBFC-P2P platforms. The decision was made after \"a review of the functioning of the lending platforms and lending limit was carried out by RBI.\"","category":"business"},{"title":"RBI has good idea of vulnerabilities in NBFC sector: Shaktikanta Das","content":"RBI Governor Shaktikanta Das said central bank has \"a fairly good idea\" of where NBFC sectors' vulnerabilities lie and are closely monitoring it. \"We are, wherever required, making a deep dive into their books, their balance sheet and other numbers,\" Das said. The NBFC sector has reportedly been facing a funding crunch since 2018 after defaults at IL&FS Group subsidiaries.\n","category":"business"},{"title":"CSB Bank share lists at 41% premium to issue price in trading debut","content":"Shares of Kerala-based CSB Bank listed at 41% premium against its issue price of ₹195 per share on the first day of trade on Wednesday. The stock extended gains and rallied 57% to hit a high of about ₹307 on the exchange and settled at 54% higher at ₹300. The ₹410-crore IPO of CSB Bank was subscribed nearly 87 times.\n","category":"business"},{"title":"SBI to cut 8% stake in UTI mutual fund through IPO","content":"State Bank of India will cut its stake in mutual fund UTI Asset Management Company (UTI AMC) by about 8.25% through an initial public offering. The bank holds an 18.24% stake in the company. SBI will cut its stake in UTI AMC through an offer for sale of up to 10.5 million shares, the bank said in a filing. ","category":"business"},{"title":"Canada's CPPIB to invest up to $600 mn through NIIF Master Fund","content":"Canada Pension Plan Investment Board (CPPIB) will invest up to $600 million through the National Investment and Infrastructure Fund (NIIF) Master Fund. CPPIB will also become a shareholder in NIIF's investment management firm. With CPPIB's investment, NIIF's Master Fund now has $2.1 billion in commitments including investment from AustralianSuper and Ontario Teachers' Pension Plan.","category":"business"},{"title":"IL&FS reports ₹22,527 crore net loss for FY19","content":"IL&FS has reported a loss of ₹22,527 crore for the year ended March 2019 compared to a net profit of ₹333 crore last year. The company has posted a revenue of ₹824 crore, against ₹1,734 crore in the previous year and its liabilities rose to ₹21,083 crore. IL&FS is currently undergoing a debt resolution process in the bankruptcy court.","category":"business"},{"title":"South African bowler celebrates wicket with magic trick, video goes viral","content":"During a Mzansi Super League match against Durban Heat, Paarl Rocks' South African spinner Tabraiz Shamsi celebrated Wihan Lubbe's wicket by performing a magic trick on the field. The 29-year-old took out red handkerchief from his pocket and turned it into a stick. Shamsi had earlier said that he wanted to become a magician from the age of about 15-16.","category":"sports"},{"title":"Sehwag fell short by 7 runs to become 1st player with 3 triple tons","content":"On December 4, 2009, Virender Sehwag was dismissed for 293(254) on the third day of the Mumbai Test against Sri Lanka, falling short by just seven runs to become the first cricketer to hit three Test triple centuries. Sehwag, whose innings included 40 fours and seven sixes, was dismissed by Muttiah Muralitharan in the fourth over of the day.","category":"sports"},{"title":"Italian paper labels clash of black footballers as 'Black Friday', criticised","content":"Italian newspaper 'Corriere dello Sport' has been criticised for a front page with headline 'Black Friday' in regards to ex-Manchester United teammates Romelu Lukaku and Chris Smalling facing each other. \"The media fuels racism every day,\" The Fare network, which works against discrimination in football, tweeted. \"We are and will always be against all forms of discrimination,\" Inter Milan tweeted.","category":"sports"},{"title":"3rd umpire, not on-field umpires, to call front foot no-balls in India-WI series","content":"Front foot no-balls in the T20I and ODI series between India and West Indies will be called by third umpire and not on-field officials, the ICC announced. \"If a late no-ball call is communicated...on-field umpire will rescind a dismissal (if applicable) and call no-ball,\" ICC said. It added the benefit of doubt in close calls will lie with the bowler.","category":"sports"},{"title":"Who doesn't want to represent India in T20 World Cup: Ashwin","content":"Off-spinner Ravichandran Ashwin has said that he wants to represent India in limited-overs cricket and wants to play the 2020 T20 World Cup. \"Who does not want to represent India in the 2020 T20 World Cup. Yuvraj Singh came back for World T20 in 2014 and then in 2017 Champions Trophy. I am only 33,\" he added.","category":"sports"},{"title":"Virat a good player but can't be put in same category as Sachin: Razzaq","content":"Former Pakistan all-rounder Abdul Razzaq has said that Virat Kohli is a good player for India but he cannot be placed in the same category as Sachin Tendulkar. \"There were world-class players from 1992 to 2007. Now there are no longer world-class players. There is no depth in bowling, batting or fielding. It is all basic now,\" he added.","category":"sports"},{"title":"Bradman once hit 185 in 1 innings, India scored 156 in entire match","content":"Legend Don Bradman smashed 185 runs to help Australia post 382 against India in a Test that ended on December 4, 1947. India were dismissed for 58 in the first innings and 98 in the second and their combined score of 156 could not overhaul Bradman's individual score. The highest score for India in the match was Chandu Sarwate's 26.","category":"sports"},{"title":"Invite kyun nahi kiya: Rashid Khan wishes Manish Pandey on getting married","content":"Afghanistan leg-spinner Rashid Khan took to Twitter to wish his SunRisers Hyderabad teammate Manish Pandey on getting married. \"Congratulations my brother @im_manishpandey Raja wishing you a lifetime of happiness together and a love that grows stronger with each passing day. Lekan Invite Q nahi kya (But why didn't you invite me?),\" Rashid wrote. Manish married South Indian actress Ashrita Shetty.","category":"sports"},{"title":"Team once took 20 wkts for 59 after hitting 910 in 1 innings","content":"Pakistan Railways dismissed Dera Ismail Khan for 59 runs combined in two innings after registering 910\/6 in their first innings in a first-class match which ended on December 4, 1964. Pakistan Railways' winning margin of an innings and 851 runs is the biggest first-class victory ever. The match witnessed a triple ton, a double hundred, two hundreds and 11 ducks.","category":"sports"},{"title":"Agarkar scored only 1 ton in int'l cricket, it was at Lord's","content":"Former Indian cricketer Ajit Agarkar scored only one international hundred in his career, which came in a Test against England at Lord's in July 2002. Batting at number eight, Agarkar slammed an unbeaten 109, becoming the seventh Indian to smash a Test ton at Lord's. Agarkar, who turned 42 today, also hit the fastest fifty by an Indian in ODIs.","category":"sports"},{"title":"Pak fans criticise Imam-ul-Haq over laughing picture, Gillespie responds","content":"Pakistani fans criticised opener Imam-ul-Haq over his laughing picture with Justin Langer following Pakistan's defeat against Australia. \"This shameless man doesn't deserve to be in team,\" a fan wrote. Defending Imam, ex-Australian pacer Jason Gillespie tweeted, \"Players on losing side are disappointed...I thought it was fantastic...Imam was spending time with...Langer talking about cricket.\"","category":"sports"},{"title":"Former England captain Bob Willis dies aged 70 due to cancer","content":"Former England captain Bob Willis has died at the age of 70 after battle with cancer. The former fast bowler played in 90 Tests and 64 ODIs for England after his 1971 debut and retired in 1984. Finishing his Test career with 325 wickets, Willis stands at fourth on the all-time list of England wicket-takers.","category":"sports"},{"title":"Bumrah is a baby bowler, I would have easily dominated him: Abdul Razzaq","content":"Former Pakistan all-rounder Abdul Razzaq has said he would not have had any problems in dealing with Jasprit Bumrah if he had still been active now. \"I have played against great bowlers like Glenn McGrath and Wasim Akram, so Bumrah is a baby bowler in front of me and I could have easily dominated and attacked him,\" he added.","category":"sports"},{"title":"Pose kam maar, batting karle thoda: Rohit trolls Jadhav over Instagram pics","content":"Batsman Kedar Jadhav took to Instagram to share pictures of himself with a bat in his hand. \"Feels good to be back on the field and do what I like to do,\" Jadhav captioned the pictures. Trolling Jadhav for posing with the bat, Team India opener Rohit Sharma wrote, \"Pose kam maar, batting karle thoda.\"","category":"sports"},{"title":"Only one spot left in Team's pace attack for T20 World Cup: Kohli","content":"India captain Virat Kohli has said that there's only one spot to be filled in the Team's pace attack for the ICC T20 World Cup set to be held in Australia next year. \"I think Bhuvi (Bhuvneshwar) and (Jasprit) Bumrah are experienced bowlers…(Mohammed) Shami is coming back,\" he added suggesting that the three have most likely sealed their places.","category":"sports"},{"title":"Pujara to play first two games for Saurashtra in Ranji Trophy","content":"Cheteshwar Pujara has been named in the 16-member Saurashtra squad for its first two games in the Ranji Trophy, beginning from December 9. Saurashtra, who lost to Vidarbha in last year's Ranji Trophy final, are placed in the Elite Group B and will play their first match against Himachal Pradesh in Dharamshala. Left-arm pacer Jaydev Unadkat will lead Saurashtra.","category":"sports"},{"title":"Eden Hazard may miss El Clasico after ankle fracture","content":"Real Madrid forward Eden Hazard is likely to miss La Liga's El Clasico against Barcelona, to be held on December 19 at 12.30 am (IST), after being diagnosed with a fractured ankle. Hazard was injured during last week's 2-2 draw against Paris Saint-Germain in the Champions League group stage match. Today Madrid revealed that Hazard has \"an incomplete external microfracture\".\n","category":"sports"},{"title":"Current Pakistan team probably worst of the lot: Ian Chappell","content":"Former Australia captain Ian Chappell has said that the current Pakistan cricket team is \"probably the worst of the lot\". This comes after Pakistan failed to win a single match during their three-T20I and two-Test match series Down Under. Pakistan last won their Test in Australia in 1995 and since then have lost 14 straight Tests on Australian soil. ","category":"sports"},{"title":"We can make him bat with a stump: WI coach on how to get Kohli out","content":"On being asked about his plans for India captain Virat Kohli, West Indies coach Phil Simmons jokingly said that they can maybe have two bowlers to bowl at Kohli at the same time. Another option is to \"make him bat with a stump,\" Phil added. \"We can make sure that the bowlers don't get too scared of him,\" he stated.","category":"sports"},{"title":"See you soon in Italy: Zlatan Ibrahimovic hints at Serie A return","content":"Former Manchester United and Barcelona striker Zlatan Ibrahimovic has hinted at his return to Serie A by saying \"see you soon in Italy\" during an interview. This comes amid reports of the Swedish forward being offered a six-month deal by his former Italian side AC Milan. Last month, Ibrahimovic announced his decision to part ways with MLS club LA Galaxy.","category":"sports"},{"title":"Satwik-Chirag, Pramod Bhagat nominated for BWF Awards 2019","content":"Indian men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty and para-shuttler Pramod Bhagat have been nominated for 'Most Improved Player of the Year' and 'Male Para Badminton Player of the Year' respectively by the Badminton World Federation (BWF). The awards will be presented on December 9 in Guangzhou during the opening ceremony of BWF World Tour Finals. ","category":"sports"},{"title":"Man Utd deserved to win: Jose Mourinho after Spurs defeat","content":"After Tottenham Hotspur lost to Manchester United 1-2 at Old Trafford late on Wednesday, Spurs manager Jose Mourinho said that his former club deserved to win. \"I think for the first 30 minutes they were the best team,\" he added. This was the Spurs' first defeat under Mourinho after having won three games in a row. ","category":"sports"},{"title":"Need to protect West Indies youngsters from 'vultures': Pollard","content":"West Indies limited-overs captain Kieron Pollard has said that there's a need to protect young Windies cricketers from \"vultures\" who are out there to pull them down. \"They (young players) need experience and we need to back these guys,\" he added. Windies are set to play against India without some of their senior players including Carlos Brathwaite, Chris Gayle. \n","category":"sports"},{"title":"Foundation of Indian pace attack laid by likes of Kapil Dev: Bishop","content":"Former Windies pacer Ian Bishop has said that the foundation of the current Indian pacers was laid by the likes of Kapil Dev. \"Now it's been built on with a captain who likes fast bowlers, who believe[s] in them,\" he added. Calling Bumrah a \"generational talent\", Bishop stated that both Shami and Ishant have taken their games to \"another level\".\n","category":"sports"},{"title":"I'm not here to replace Hardik Pandya: Shivam Dube ","content":"On being included in the squads for T20I and ODI series against West Indies, all-rounder Shivam Dube said that it's not an opportunity to replace Hardik Pandya. \"I have got a job for my country and I will try to do that better,\" he added. Dube made his India debut during the T20I series against Bangladesh last month. ","category":"sports"},{"title":"From learning alphabets in Jawahar to Alphabet CEO: Xiaomi India VP to Pichai","content":"Xiaomi's Global Vice President and India VP Manu Kumar Jain on Wednesday took to Twitter to congratulate Sundar Pichai on being appointed as Alphabet's CEO. \"From learning alphabets in Jawahar Vidyalaya to leading \"Alphabet\"...You are an inspiration to all,\" tweeted Jain. Notably, Sundar Pichai studied at CBSE-affiliated Jawahar Vidyalaya in Chennai till Class 10.","category":"technology"},{"title":"I've underwear on: Jason Derulo after Instagram removes his pic over 'nudity'","content":"American singer Jason Derulo has revealed that Instagram removed a picture he posted as it went \"against its Community Guidelines on nudity or sexual activity\". \"[F**k you] mean? I've underwear on...I can't help my size,\" he wrote while sharing a screenshot of the Instagram notification which said his post has been removed. The singer also posted the photo once again. ","category":"technology"},{"title":"Instagram to ask new users their age to keep young people 'safer'","content":"Nine years after launch, Instagram announced the addition of a feature to know the birth date and subsequently the age of the users who will sign up on its platform. \"In the coming weeks, we'll give you more control over who can message you,\" the Facebook-owned platform said. \"This will help us keep young people safer,\" it added.","category":"technology"},{"title":"Google Co-founders gain $2.3B after Sundar Pichai made Alphabet CEO","content":"Google Co-founders Sergey Brin and Larry Page added a combined $2.3 billion to their net worths after Google-parent Alphabet's stock rose about 2%, Bloomberg revealed. This came after Google's 47-year-old India-born CEO Sundar Pichai on Wednesday was also named Alphabet CEO. The two co-founders each own about 6% of the internet giant and still control Alphabet through special voting shares.","category":"technology"},{"title":"Chip-based optical sensor detects cancer biomarker in urine","content":"The Netherlands' University of Twente researchers used a chip-based sensor with an integrated laser to detect very low levels of a cancer protein biomarker in a urine sample. \"Current methods to measure biomarker levels are expensive and sophisticated,\" the research team leader said. The device can also potentially be used to detect different types of gases or liquid mixtures.","category":"technology"},{"title":"What is the life journey of Sundar Pichai, CEO of Alphabet and Google?","content":"Madurai-born Alphabet CEO Sundar Pichai, an alumnus of Wharton, Stanford University and IIT Kharagpur, worked at McKinsey & Co before joining Google in 2004. Credited for making the Google Chrome browser, Pichai took over Android business from its founder Andy Rubin. He was named head of Google's products before being promoted as Google CEO when Alphabet was created in 2015.","category":"technology"},{"title":"Sundar Pichai's last name misspelt as 'Pinchai' on WSJ's front page","content":"American newspaper The Wall Street Journal misspelt the last name of Google's parent company Alphabet's newly-appointed CEO Sundar Pichai as 'Pinchai'. Twitter users reacted to the error with tweets like, \"If only WSJ had Googled his name\" and \"That would pinch the writer hard!\" The newspaper later issued a correction for the mistake on its website.","category":"technology"},{"title":"Bengaluru man orders pizza through app, ends up losing ₹95,000 in online scam","content":"A resident of Bengaluru's Koramangala lost ₹95,000 in online scam after ordering a pizza through an app. The man looked for the app's customer care number after not receiving the pizza for an hour. A fraudster posing as a customer care executive sent him a message for refund. The fraudsters accessed his bank account details and deducted ₹95,000.","category":"technology"},{"title":"New AI understands laws of physics 'intuitively', says MIT","content":"MIT researchers developed a new AI model ADEPT, which they claim is able to understand some laws of physics 'intuitively'. The model registers \"surprise\" when objects in simulations move in unexpected ways, like rolling behind a wall and not reappearing on the other side, MIT said. The model could potentially help scientists explore how infants understand the world, it added.","category":"technology"},{"title":"India may force FB, TikTok to offer user verification: Reports","content":"India may soon force platforms like Facebook and TikTok to offer a user verification option, a potential step toward reining the spread of \"fake news\", Reuters reported. With the required mechanism in place, users will have a mark of verification similar to the blue check-mark on Twitter. However, the verification would be optional for users, the report added. ","category":"technology"},{"title":"Google launches private chat feature in its Google Photos app","content":"Google has launched a messaging feature in Google Photos which will allow users to send one-off photos and videos to an ongoing, private conversation in the app for a \"simpler experience\". \"You can like photos or comment in the conversation and you can save these photos or videos to your own gallery,\" said Janvi Shah, Product Manager for Google Photos.","category":"technology"},{"title":"Fired Google employees to charge firm with unfair labour practices","content":"After Google fired four employees over violation of data security policies, the employees are planning to file labour charges against the tech giant. The employees argued that they weren't fired for violating the policies but for speaking against the company's practices. Google has been facing protests over issues including its work with the military and handling of sexual abuse complaints.","category":"technology"},{"title":"Personal data of 20 WhatsApp users accessed via Pegasus spyware: Govt","content":"IT Minister Ravi Shankar Prasad said that personal data of 20 WhatsApp users were accessed by the NSO Group in the Pegasus spyware attack out of the 121 users whose devices were targeted. Meanwhile, the government had announced in November it would conduct an audit of WhatsApp's security systems. The Pegasus spyware attack infected about 1,400 devices across 20 countries.\n\n","category":"technology"},{"title":"Genius sues Google for $50 million over 'stolen' song lyrics","content":"Lyrics website Genius sued Google for knowingly using copied song lyrics in search results and has asked for $50 million in damages. Genius accused lyric licensing company LyricFind of pulling lyrics directly from its page which Google subsequently used in its search results. The website hid a unique watermark in its lyrics that spelled out \"red handed\" in Morse Code. ","category":"technology"},{"title":"Parliamentary panel on women meets Facebook to discuss cyber crimes","content":"The Parliamentary Standing Committee on Women Empowerment on Thursday sought cooperation from Facebook to strengthen online vigilance in view of rising crimes against women on social media. The social media giant showed a presentation on working of the sites. The Committee was also made aware of the current system via which women can report cyber harassment or cyber bullying.","category":"technology"},{"title":"6 tech giants contributed to $100 bn 'tax gap' in 10 yrs: Study","content":"A study by a British organisation that certifies businesses for good tax conduct stated six of Silicon Valley's top tech giants avoided paying over $100 billion in taxes over the past decade. It analysed global tax payments made by Amazon, Facebook, Google, Apple, Netflix and Microsoft. The research found over a $100-billion difference between their provisions and actual taxes paid. ","category":"technology"},{"title":"Microsoft app that lets the blind identify photos gets 5 new languages","content":"Microsoft's computer vision app for the blind and poor-sighted, Seeing AI, has been updated with five more languages - Dutch, French, German, Japanese and Spanish. The app is free but is only available on iOS. Seeing AI uses 'computer vision' to narrate the user's surroundings, explore photos by touch and identify friends' facial cues.","category":"technology"},{"title":"IT panel urged to look out for child safety on social media","content":"Online community platform LocalCircles has urged parliamentary standing committee on information technology to look into issue of child safety on social media. It asked the panel to increase minimum age requirement for opening accounts on Instagram, Facebook and TikTok to 15 years. It also asked for the platforms to be held fully responsible for exposure of children to inappropriate content.","category":"technology"},{"title":"US unfairly awarded $10 bn cloud contract to Microsoft: AWS CEO","content":"Amazon Web Services (AWS) CEO Andy Jassy criticised Pentagon's decision to award the Joint Enterprise Defense Infrastructure (JEDI) contract to Microsoft, saying it was \"unfairly awarded\". \"We are talking about the defence of the US, and we have a government that has unfairly awarded a contract,\" he said. The contract, valued at $10 billion, was awarded to Microsoft in October.","category":"technology"},{"title":"India ranks 73rd in UN index assessing e-commerce readiness","content":"India has ranked 73rd out of 152 countries listed in a business-to-consumer e-commerce index by the UN, which measures an economy's preparedness to support online shopping. The list, whose top 10 spots were dominated by eight European countries, was topped by Netherlands. India's place on the list was an improvement from its previous rank of 80 in 2018.  ","category":"technology"},{"title":"New browser extension makes hidden Instagram likes visible again","content":"Instagram users will now be able to see 'Like' counts on posts by installing 'The Return of the Likes' Chrome extension after the social media firm started hiding like and comment counts on its platform. The feature is not available through the mobile Instagram app and can be used by copying the profile link and opening it on a computer.","category":"technology"},{"title":"Customers will soon be able to withdraw cash using UPI","content":"Customers will soon be able to withdraw cash through ATMs using UPI, apart from merchant payments and interpersonal transactions. The new feature will be introduced for users of Bank of India in the next three-six months. NPCI has created a committee to review the interoperability guidelines to open the feature for other bank customers as well, as per reports.","category":"technology"},{"title":"Duolingo raises $30 million from Alphabet's CapitalG","content":"Language-learning app Duolingo raised $30 million in a Series F funding from Alphabet's CapitalG. Post the investment, Duolingo's valuation stands at $1.5 billion. At present, Duolingo's total funding comes to $138 million with investments from Ashton Kutcher and Tim Ferriss, among others. It is now the first Pittsburgh-based tech startup valued at more than $1 billion.","category":"technology"},{"title":"Ford to use McDonald's coffee bean waste to make car parts","content":"Ford and McDonald's have partnered for a project in which the carmaker will use coffee bean waste to make auto parts like headlamp housings. Ford will use coffee chaff - bean husk that comes off during roasting - which can be mixed with plastic and formed into shapes. Notably, Ford has been using soy-based foam in its cushions since 2011.","category":"technology"},{"title":"Indian govt wouldn't want to be too far behind on 5G: Qualcomm","content":"Discussing India's readiness to launch 5G spectrum, Senior VP of Qualcomm Alex Katouzian said since 5G has a major impact on the economy, India wouldn't want to be left far behind the rest. He also talked about discussions with Indian government regarding impact of 5G on various markets. Katouzian said economic impact will make India accelerate its move to 5G.","category":"technology"},{"title":"'La La Land' actress Emma Stone gets engaged; fiancé shares 1st pic","content":"'La La Land' actress Emma Stone got engaged to filmmaker Dave McCary after reportedly dating for 2 years. Dave announced their engagement on Thursday with an Instagram picture, in which Emma can be seen showing her ring. They met when she hosted Saturday Night Live in 2016 and starred in the sketch 'Wells for Boys', which McCary directed.\n","category":"entertainment"},{"title":"Filmmaker says 'women should carry condoms, cooperate with rapists'; criticised","content":"Daniel Shravan, a filmmaker, has been criticised for writing on Facebook that instead of calling police, women should carry condoms and cooperate with rapists to save themselves from murder. He later deleted his posts, saying he wrote those as dialogues of a villain in a movie he'll direct. \"Whoever this Daniel Shravan is, needs medical help,\" actress Kubbra Sait tweeted. ","category":"entertainment"},{"title":"I've friends who're better than me: Hrithik on Akshay beating him at box-office","content":"Actor Hrithik Roshan has shared a report on Twitter about Akshay Kumar beating him at the box-office in 2019. \"How good would I be if I didn't have friends who were better than me,\" he wrote while adding a clapping emoji. The report stated that Akshay's 'Housefull 4' beat Hrithik's 'War' in terms of earnings in Mumbai.","category":"entertainment"},{"title":"Adult film star claims Censor Board members demanded bribe to pass film","content":"Malayalam adult film actress Shakeela has claimed that two Censor Board members asked her for bribe to pass her upcoming production venture 'Ladies Not Allowed', an adult comedy. \"Our film has been [rejected] by...Censor Board not once but twice so far,\" she said. Shakeela added, \"Before starting the movie, we made it clear that we're making an adult comedy.\"","category":"entertainment"},{"title":"If I was 50, I would feel odd romancing a 22-yr-old guy: Sonakshi","content":"Speaking about the growing age gap between Bollywood actors and their heroines, Sonakshi Sinha said, \"If I was...50, I'd feel odd romancing a 22-year-old guy.\" She added that audience accepts it when an older actor romances a younger actress, but when an older actress does it, it's not accepted. \"That...shows what kind of a country we live in,\" said Sonakshi.","category":"entertainment"},{"title":"People should date who they want to: DiCaprio's girlfriend on 23-yr age gap","content":"Speaking about their 23-year age gap, Leonardo DiCaprio's girlfriend, actress Camila Morrone said, \"There are...many relationships in Hollywood, and in...the world, where people have large age gaps.\" \"I just think anyone should be able to date who they want to date,\" she added. Camila further said she's hopeful that as her career grows, she won't always be mentioned alongside DiCaprio.","category":"entertainment"},{"title":"Randeep Hooda dislocates knee during stunt, carried off set on shoulders","content":"Actor Randeep Hooda dislocated his patella while shooting a stunt sequence for 'Radhe: Your Most Wanted Bhai'. \"A co-actor jumped on my back with all his might...bringing all the weight down on one knee,\" he said. \"I tried to do more takes but that caused more damage...I had to be carried off the set on people's shoulders,\" Randeep added.","category":"entertainment"},{"title":"Hrithik Roshan voted sexiest Asian male of the decade by British newspaper","content":"Hrithik Roshan has been voted the sexiest Asian male of 2019 as well as the last decade in an online poll released by British weekly newspaper Eastern Eye. Hrithik thanked his voters and added that he doesn't view it as an \"achievement\". \"I don't judge people by [looks]...What is attractive in a person is his or her journey,\" he stated.","category":"entertainment"},{"title":"I stalk Priyanka Chopra on social media, I think she has a baller life: Bhumi","content":"Actress Bhumi Pednekar in an interview to Zoom revealed that she stalks Priyanka Chopra on social media. \"I am constantly seeing what she's up to. I think she has a baller life,\" Bhumi added. The actress, who will appear alongside actor Kartik Aaryan in 'Pati Patni Aur Woh', also said that the latter's social media game is brilliant.","category":"entertainment"},{"title":"Neha Kakkar criticises comedy act for mocking her height and singing","content":"Singer Neha Kakkar took to Instagram Story to criticise a comedy act featuring a character named 'Neha Shakkar', who's also a singer, said to be based on her. The act mocked the character's height and singing. Neha wrote, \"Shame on these people to create such NEGATIVE and insulting content!\", while her brother Tony also criticised the act for body-shaming her.","category":"entertainment"},{"title":"Was in Goa, wanted to walk into ocean & never return: Pooja on feeling suicidal","content":"Speaking about battling mental health issues, actress-producer Pooja Bhatt spoke about contemplating suicide once. \"I was coming back from Goa, from a rave...Everyone was feeling great and I was feeling damn low,\" she said. \"I called my father and said I'm feeling almost suicidal, I just want to walk into that ocean and never come back,\" Pooja added.","category":"entertainment"},{"title":"I've underwear on: Jason Derulo after Instagram removes his pic over 'nudity'","content":"American singer Jason Derulo has revealed that Instagram removed a picture he posted as it went \"against its Community Guidelines on nudity or sexual activity\". \"[F**k you] mean? I've underwear on...I can't help my size,\" he wrote while sharing a screenshot of the Instagram notification which said his post has been removed. The singer also posted the photo once again. ","category":"entertainment"},{"title":"Justin Timberlake apologises to wife over pics of him holding co-star's hand","content":"Singer Justin Timberlake has apologised to his wife, actress Jessica Biel, on Instagram after pictures of him holding his co-star Alisha Wainwright's hand surfaced. He blamed alcohol for his \"lapse in judgement\" while on a night out, but insisted \"nothing happened\" between them. The incident took place last month when Timberlake was spotted holding Alisha's hand on a bar's balcony.","category":"entertainment"},{"title":"Bigg Boss 13's Arhaan Khan accused of cheating ex-girlfriend of ₹5 lakh","content":"Bigg Boss 13 contestant Arhaan Khan has been accused by his reported ex-girlfriend, actress Amrita Dhanoa, of cheating her of ₹5 lakh. Amrita claimed she has filed a complaint at Oshiwara police station, saying he cheated her financially and emotionally. She also claimed that they had a live-in relationship for over five years. ","category":"entertainment"},{"title":"Ask him only: Sonakshi when asked about Salman romancing 21-yr-old actress","content":"When asked about 53-year-old Salman Khan romancing a 21-year-old actress, Sonakshi Sinha said, \"You should ask him only.\" \"[Ask him] what he's...doing to keep looking so young and keep romancing the younger girls,\" she added. On being pointed out that we never see \"a Madhuri Dixit romancing Ishaan Khatter\", Sonakshi said, \"But would you want to see [that]?...That [would be]...odd.\" ","category":"entertainment"},{"title":"Man stalks, assaults TV actress and ex-Splitsvilla contestant Harshita; held","content":"The Churchgate Government Railway Police has arrested a 29-year-old man for allegedly stalking and assaulting actress and Splitsvilla 8 contestant Harshita Kashyap as well as her NRI friend at Charni Road railway station. Harshita alleged the man constantly kept stalking them and slapped her friend when confronted. \"I...started hitting him. He retaliated and he even started hitting me,\" she added.","category":"entertainment"},{"title":"All I wanted to do was sleep: Deepika on fighting depression","content":"Deepika Padukone, in an interview with The New York Times, opened up about her battle with depression. \"Waking up every day felt like a huge endeavour. All I wanted to do was sleep. When I was asleep, I didn't have to deal with reality,\" she said. \"For months I suffered silently, not knowing what was happening to me,\" Deepika added.","category":"entertainment"},{"title":"Imtiaz Ali has changed my acting process, personal mindset: Kartik","content":"Talking about working with 'Love Aaj Kal 2' director Imtiaz Ali, Kartik Aaryan said that both his \"acting process and personal mindset\" have changed after working with him. \"I think I'm a changed man now. There has been a huge change in me since I've shot for his film,\" he added. \"I'm in love with Imtiaz sir,\" Kartik further said.","category":"entertainment"},{"title":"Rishi gets criticised for calling The Irishman 'boring', actor responds","content":"Rishi Kapoor got criticised on Twitter for calling Martin Scorsese's 'The Irishman', \"painfully slow and boring\". He responded to the same by writing, \"Unfair...I hated 'Once upon a time in Hollywood' too. Have seen better works of...actors\/directors involved!\" Earlier, a user had commented on Rishi's tweet, \"I HEARD YOU PAINT HOUSES,\" and another had replied, \"And do the carpentry too.\"","category":"entertainment"},{"title":"I loved a married director but didn't want to be homewrecker: Parekh","content":"Actor Asha Parekh revealed in an interview that late director Nasir Hussain, known for making Qayamat Se Qayamat Tak (1988), was the only man \"she has ever loved\". She added that since Nasir was a married man, she chose not to be a homewrecker. \"As much as I loved him...could never consider breaking up his family.\" she further said.","category":"entertainment"},{"title":"Priyanka Chopra receives UNICEF's Danny Kaye Humanitarian Award","content":"Actress Priyanka Chopra, who is UNICEF's Goodwill Ambassador, was honoured with the Danny Kaye Humanitarian Award at the organisation's Snowflake Ball in New York on Tuesday. \"Giving back is no longer a choice...it has to be a way of life,\" she said in her speech. \"Thank you...to serve as your Goodwill Ambassador is the privilege of my life,\" Priyanka tweeted.","category":"entertainment"},{"title":"I can't imagine living my life with no fear for my safety: Shibani","content":"Singer and actress Shibani Dandekar recalled an incident when once she couldn't find her car and had to walk down a street. \"Suddenly, I felt... scared. It wasn't even late at night,\" she said. \"I can't imagine having this feeling all the time...which many women probably have...I can't imagine living my life with no fear for my safety,\" Shibani added.","category":"entertainment"},{"title":"Check your filmy ethics before lecturing: Shoojit Sircar to Bollywood","content":"Director Shoojit Sircar on Wednesday took to Twitter and asked the Bollywood fraternity to check their \"filmy ethics\" before lecturing. \"Bollywood, let's first better ourselves and then preach,\" he wrote. \"We'll protest on naitikta (morality) but first let's check our filmy ethics and get rid of our duality,\" he added. It was, however, unclear as to whom Sircar was targeting.","category":"entertainment"},{"title":"I've to feel butterflies in my stomach: Deepika on choosing scripts","content":"Deepika Padukone has said that she continues to choose scripts, the same way she did 10 years ago. \"When the narration finishes, I've to feel butterflies in my stomach, otherwise I don't take up the film. The film has to unsettle me,\" she said. \"I've to feel challenged. I've always listened to that voice in my head,\" Deepika added.","category":"entertainment"},{"title":"I've gotten rid of plastic bottles: Kim after Kourtney gets criticised","content":"American media personality Kim Kardashian revealed that she has \"gotten rid of all the plastic water bottles in her house\". This comes after her elder sister, Kourtney Kardashian got criticised for using a plastic bottle during an episode of 'Keeping Up with the Kardashians'. \"I could've brought a reusable bottle for the day, this is true,\" Kourtney tweeted later.","category":"entertainment"}]